{
  "</box>": 151670,
  "</image>": 151666,
  "</image_id>": 151678,
  "</point>": 151674,
  "</quad>": 151672,
  "</ref>": 151668,
  "</slice>": 151676,
  "</tool_call>": 151658,
  "<box>": 151669,
  "<image>": 151665,
  "<image_id>": 151677,
  "<point>": 151673,
  "<quad>": 151671,
  "<ref>": 151667,
  "<slice>": 151675,
  "<tool_call>": 151657,
  "<|box_end|>": 151649,
  "<|box_start|>": 151648,
  "<|endoftext|>": 151643,
  "<|file_sep|>": 151664,
  "<|fim_middle|>": 151660,
  "<|fim_pad|>": 151662,
  "<|fim_prefix|>": 151659,
  "<|fim_suffix|>": 151661,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<|image_pad|>": 151655,
  "<|object_ref_end|>": 151647,
  "<|object_ref_start|>": 151646,
  "<|quad_end|>": 151651,
  "<|quad_start|>": 151650,
  "<|repo_name|>": 151663,
  "<|video_pad|>": 151656,
  "<|vision_end|>": 151653,
  "<|vision_pad|>": 151654,
  "<|vision_start|>": 151652
}
